app/views/posts/_form.html.erb

    <%= f.label :author %><br>
    <%= f.collection_select :author_id, Author.all, :id, :name %>
---
SELECT "authors".* FROM "authors"